app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
---
    <div class="hovereffect">
      <%= image_tag group.group_image.url, :class=>"img-responsive" %>