app/views/groups/show.html.erb

                <tbody>
                  <% @group.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."group_id" = $1  [["group_id", 4]]

          <strong>Tags:</strong>
          <% @group.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "events_tags" ON "tags"."id" = "events_tags"."tag_id" INNER JOIN "events" ON "events_tags"."event_id" = "events"."id" WHERE "events"."group_id" = $1  [["group_id", 1]]

      <div class="sidebar-module">
        <h4>Members (<%= @group.users.length%>)</h4>
---
SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = $1  [["group_id", 4]]