app/views/users/show.html.erb

                  <tbody>
                    <% @user.created_events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]

                  <tbody>
                    <% @user.events_attending.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = $1  [["user_id", 2]]