app/views/events/_form.html.erb

SELECT "groups".* FROM "groups"
---
    <%= f.label :group_id %>
    <%= f.collection_select :group_id, Group.all, :id, :title %>

SELECT "tags".* FROM "tags"
---
  <div class="field">
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>