app/views/events/index.html.erb

    <% @events.each do |event| %>
      <div class="col-xs-6 col-md-3 for-search" data-searchstring="<%= event.tags.first.name %> <%= event.location %>">
---
SELECT  "tags".* FROM "tags" INNER JOIN "events_tags" ON "tags"."id" = "events_tags"."tag_id" WHERE "events_tags"."event_id" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["event_id", 1], ["LIMIT", 1]]

              <div class="activity-mini">
                <i class="glyphicon glyphicon-comment text-muted"></i> <%= event.comments.size %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."event_id" = $1  [["event_id", 1]]