app/views/events/show.html.erb

            <section class="comment-list">
              <% @event.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = $1  [["event_id", 1]]

          <strong>Tags:</strong>
          <% @event.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "events_tags" ON "tags"."id" = "events_tags"."tag_id" WHERE "events_tags"."event_id" = $1  [["event_id", 1]]

          <strong>Group:</strong>
          <%= link_to @event.group.title, group_path(@event.group) %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]