app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @event = Event.find(comment_params[:event_id])
    @event.comments << @comment
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "gfgv"], ["user_id", 1], ["event_id", 1], ["created_at", 2016-08-09 08:42:31 UTC], ["updated_at", 2016-08-09 08:42:31 UTC]]