app/controllers/events_controller.rb

SELECT "groups".* FROM "groups"
SELECT "tags".* FROM "tags"
---
  def new
    @event = Event.new
    @groups = Group.all
    @tags = Tag.all

INSERT INTO "events" ("title", "start_date", "end_date", "location", "description", "user_id", "created_at", "updated_at", "event_image", "group_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    current_user.created_events << @event

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1, "event_image" = $2 WHERE "events"."id" = $3  [["updated_at", 2016-08-07 14:02:05 UTC], ["event_image", "game_of_death_1600.jpg"], ["id", 5]]
---
  def update
    if event_params[:user_id]
      @event.creator = User.find(event_params[:user_id])
    end
    respond_to do |format|
      if @event.update(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def upvote
    @event = Event.find(params[:id])