app/controllers/groups_controller.rb

INSERT INTO "groups" ("title", "location", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "aadsdasdasda"], ["location", "asdasdasd"], ["description", "adsdasdasdasd"], ["created_at", 2016-08-08 10:55:48 UTC], ["updated_at", 2016-08-08 10:55:48 UTC]]
---
  def create
    @group = Group.new(group_params)
    @group.users << current_user