app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Entertainment"], ["created_at", 2016-08-09 09:51:48 UTC], ["updated_at", 2016-08-09 09:51:48 UTC]]